app/controllers/api/v1/auth_controller.rb

    def login
        user = User.find_by(name: auth_param[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "a"], ["LIMIT", 1]]