app/controllers/api/v1/links_controller.rb

    def getUserLinks
        user = current_user
        render json: {links: user.objectives.map{|objective| objective.afters_links}}
---
SELECT "objectives".* FROM "objectives" WHERE "objectives"."user_id" = $1  [["user_id", 1]]