app/controllers/api/v1/objectives_controller.rb

INSERT INTO "objectives" ("name", "user_id", "description", "duration", "seconds", "minutes", "hours", "days", "months", "years", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def createNoLink
        user = current_user
        newObj = Objective.create(name: params[:name], user: user, description: params[:description], duration: params[:duration], seconds: params[:seconds], minutes: params[:minutes], hours: params[:hours], days: params[:days], months: params[:months], years: params[:years])

INSERT INTO "objectives" ("name", "user_id", "description", "duration", "seconds", "minutes", "hours", "days", "months", "years", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "links" ("before_id", "after_id", "delay", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["before_id", 52], ["after_id", 53], ["delay", 30], ["created_at", "2021-06-01 08:04:17.398374"], ["updated_at", "2021-06-01 08:04:17.398374"]]
---
    def newObjLink
        user = current_user
        newObj = Objective.create(name: params[:name], user: user, description: params[:description], duration: params[:duration], seconds: params[:seconds], minutes: params[:minutes], hours: params[:hours], days: params[:days], months: params[:months], years: params[:years])
        newlink = Link.create(before_id: params[:linkedObjectiveid], after_id: newObj.id, delay: params[:delay])

SELECT  "objectives".* FROM "objectives" WHERE "objectives"."id" = $1 LIMIT $2  [["id", 85], ["LIMIT", 1]]
DELETE FROM "objectives" WHERE "objectives"."id" = $1  [["id", 85]]
DELETE FROM "objectives" WHERE "objectives"."id" = $1  [["id", 96]]
---
    def deleteObj
        user = current_user
        obj = Objective.all.find_by(id: params[:id])
        obj.afters_links.destroy_all
        obj.befores_links.destroy_all
        obj.destroy

SELECT "objectives".* FROM "objectives"
UPDATE "objectives" SET "duration" = $1, "months" = $2, "days" = $3, "updated_at" = $4 WHERE "objectives"."id" = $5  [["duration", "28800"], ["months", "6"], ["days", "2"], ["updated_at", "2021-06-02 18:17:38.610614"], ["id", 115]]
---
    def editObj
        user = current_user
        objectives = params[:data]
        allObjectives = Objective.all
        objectives.each{|objective| allObjectives.find{|objectivea| objectivea["id"] == objective["id"].to_i}.update(name: objective["name"], description: objective["description"], duration: objective["duration"].to_i, years: objective["years"], months: objective["months"], days: objective["days"], hours: objective["hours"], minutes: objective["minutes"], seconds: objective["seconds"])}