app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", " a"], ["password_digest", "$2a$12$e.6G41q5cWTnJiwa64m5X.8xxj.4V8BtT8yS648.TWjLL9R7F0cl6"], ["created_at", "2021-06-01 18:45:30.808762"], ["updated_at", "2021-06-01 18:45:30.808762"]]
---
    def create
        User.create(name: params[:name], password: params[:password])

UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "b"], ["password_digest", "$2a$12$hdy1CaWFE4htdrp5sdSuwOfiDFlYaTOn3RR0oZD8WsmPagDl.k9ta"], ["updated_at", "2021-05-30 07:06:23.880237"], ["id", 33]]
---
    def update
        user = current_user
        user.update(name: params[:name], password: params[:password])

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 73]]
---
    def delete
        user = current_user
        user.destroy